Tekla Open API Reference for Tekla Structures 2025
GeometryConstants.ANGULAR_EPSILON Field
 The minimum angle (radians) used for checking angular parallelism, perpendicularity, etc. Anything smaller will be considered equivalent to 0.0.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const double ANGULAR_EPSILON = 0,00174532925199433
Public Const ANGULAR_EPSILON As Double = 0,00174532925199433
Field Value
Type: Double
See Also
Reference
GeometryConstants Class
Tekla.Structures.Geometry3d Namespace